# Working with CSVs
CSV Files

Read CSV

In [2]:
import pandas as pd
df = pd.read_csv("data.csv")
df

      NAME SCHOOL  MARKS
0    anshi    DPS     56
1  anshika    DPS     78
2    avani    LLS     89
3    priya    LLS     89
4    aliza    RDS     45
5    sanya    RDS     56

In [3]:
df = df[df['MARKS']>70]

In [4]:
df

      NAME SCHOOL  MARKS
1  anshika    DPS     78
2    avani    LLS     89
3    priya    LLS     89

In [5]:
df.to_csv("data_updated.csv")

In [6]:
df.to_csv("data_updated2.csv",index=False)

In [7]:
df=pd.read_json("newdata.json")
df

      name  age
0  Anshika   20
1   Babita   22

## Excel Files
Read Excel

In [9]:
#  df = pd.read_excel("data.xlsx") 
#  pd.read_excel("data.xlsx", sheet_name="Sales")

## Write Excel

In [11]:
# df.to_excel("output.xlsx", index=False)

## Multiple sheets:

In [13]:
# with pd.ExcelWriter("report.xlsx") as writer:
#     df1.to_excel(writer, sheet_name="Summary", index=False)
#     df2.to_excel(writer, sheet_name="Details", index=False)

## Summary
read_* and to_* methods for CSV, Excel, JSON
Use sheet_name for Excel

In [15]:
data = [
    { "Name":'anshika', "Adress":{"city":"bhopal","zipcode":"110001"}},
    { "Name":'priya', "Adress":{"city":"satna","zipcode":"110301"}},
    { "Name":'piya', "Adress":{"city":"bhopal","zipcode":"110201"}},
    { "Name":'riya', "Adress":{"city":"bhopal","zipcode":"110101"}}
]

In [31]:
data

[{'Name': 'anshika', 'Adress': {'city': 'bhopal', 'zipcode': '110001'}},
 {'Name': 'priya', 'Adress': {'city': 'satna', 'zipcode': '110301'}},
 {'Name': 'piya', 'Adress': {'city': 'bhopal', 'zipcode': '110201'}},
 {'Name': 'riya', 'Adress': {'city': 'bhopal', 'zipcode': '110101'}}]

In [37]:
type(data)

list

In [16]:
df = pd.json_normalize(data)
df

      Name Adress.city Adress.zipcode
0  anshika      bhopal         110001
1    priya       satna         110301
2     piya      bhopal         110201
3     riya      bhopal         110101

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            4 non-null      object
 1   Adress.city     4 non-null      object
 2   Adress.zipcode  4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes